[{"title":"Rhythm Heaven Visual Maker Stuff","slug":"rhythm-heaven-visual-maker-stuff","html":"<p>Alright, first off let’s get some things straight: I have almost no idea what I’m doing; NOT.</p>\n<p>I’ve probably made at least 12 rhythm games at this point, most didn’t make it past 3 months in development, but I’m feeling good about this one. I’m investing a lot of time into it, but I’m confident that this will be eventually finished.</p>\n<h2 id=\"introducing-rhythm-heaven-movie-maker-name-possibly-not-final\">Introducing Rhythm Heaven Movie Maker (name possibly not final)</h2>\n<img src=\"../assets/Images/bloggeneral/rhcanvasscreenshot0.png\" style=\"width: 90%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\">\n\n<p>Note that there is a lot in this screenshot I plan to change, but the point is that I’m really happy with how it looks right now.</p>\n<p>Now, the purpose of this program is to create visuals for Rhythm Heaven Custom Remixes. While there is an audio editor for those, this is specifically for visuals.</p>\n<p>I originally started it to help me make some visuals for a remix I was making. I’m deciding to expand it the more use cases I need for my videos. So I probably won’t be working on it full time as far as I’m concerned.</p>\n<p>The code is very dynamic and I have a function for pretty much every use case I would need, so implementing things is just a matter of time and how fast I am at animating.</p>\n<p>Here’s the Update code for Working Dough:</p>\n<img src=\"../assets/Images/bloggeneral/rhcanvasscreenshot1.png\" style=\"width: 90%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\">","date":"6/1/2022"},{"title":"Motionmelody Mania","slug":"motionmelody-mania","html":"<p>Alright so some info on Motionmelody.</p>\n<p>First off, the concept of the game is officially one year old, not the game itself. But the idea for it, so that counts in some cosmic way, right?</p>\n<p>Anyway, a lot has happened since the last time I showed anything regarding Motionmelody/Gridbeats. So I&#39;m gonna make a quick highlight showcase.</p>\n<h2 id=\"selection-system-in-level-editor\">Selection system in level editor</h2>\n<img src=\"https://i.imgur.com/XeLMpcJ.gif\" style=\"width: 90%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\">\n\n\n<h2 id=\"menu-mockups-and-ideas-although-i-dont-think-im-gonna-keep-them\">Menu mockups and ideas, although I don&#39;t think I&#39;m gonna keep them.</h2>\n<img src=\"https://i.imgur.com/t2LrRD7.gif\" style=\"width: 90%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\">\n\n\n<h2 id=\"old-screenshot-but-this-shows-what-the-gameplay-could-look-like\">Old screenshot but this shows what the gameplay could look like</h2>\n<img src=\"https://i.imgur.com/KcXDjiz.png\" style=\"width: 90%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\">\n\n<p>That&#39;s all I have for this post see you next month or whenever I decide to update this!</p>\n","date":"4/4/2022"},{"title":"Mobile port of some games","slug":"mobile-port-of-some-games","html":"<p>Appropriately after Rhythm Heaven Mania I decided to dip my toes into some mobile games.\nNow I&#39;ve never made a mobile game before, so I have no idea what to expect. I&#39;m sure there&#39;s a lot of fun to be had though.</p>\n<p>The games I decided to port was the &quot;Endless Games&quot; from Rhythm Heaven DS. I always found these fun enough and small enough to port to a mobile phone, especially if they&#39;re use something easy to grasp like the &quot;flicking&quot; mechanic.</p>\n<img src=\"https://i.imgur.com/XI971vQ.png\" style=\"width: 90%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\">\n\n<p>My mom already playtested it, and with no prior knowledge to Rhythm Heaven she pretty much mastered it in a matter of minutes.\nThat COULD be because it might be too easy, but I don&#39;t know I would have to look into it.</p>\n","date":"3/4/2022"},{"title":"We're back!","slug":"were-back","html":"<p>Gridbeats is dead, and Rhythm Heaven Mania has been given to someone else. So now what? Well, obviously I&#39;m going back to the simple life of visual effects and making video games. It was truly a fun time, but I have other things I need to do. Hopefully the Rhythm Heaven community can have fun with that while willfully curb stomping an autistic man for using the wrong word in a button on his niche blog website.</p>\n<p>Anyway, what do I have planned for the future? Well, namely a game engine. Appropriately called &quot;Starflow&quot;. It&#39;s primary purpose is stylish 3D and rhythm games. Originally created for Rhythm Heaven Mania it will now serve as the main game engine for Boxsubmus... when It&#39;s done anyway.</p>\n<img src=\"https://i.imgur.com/H2Sofos.png\" style=\"width: 90%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\">\n\n<p>Of course, this is all super early on, I&#39;ve only been working on it for a week. Who knows what it will be like in the future.</p>\n<h2 id=\"regarding-my-youtube-channel\">Regarding my YouTube channel</h2>\n<p>More likely than not, I&#39;m probably just gonna go back to YTPMV&#39;s. I had the most fun out of all the stuff I do currently, making them than ANYTHING I do now.</p>\n<p>I remember when I tried using my channel as a resource for the Rhythm Heaven soundtrack. I realized I could just make it all one video instead, and then I realized someone else was doing the same thing anyway. So I bailed on that plan. The community post is still up though for some reason, I might delete that some time never.</p>\n<p>Anyway yeah, I&#39;m going back to do the things I love. And I won&#39;t let anyone stop me. I&#39;ll see you in the next 4 months.</p>\n","date":"2/22/2022"},{"title":"GridBeats","slug":"gridbeats","html":"<p>I wanted to show a little something I&#39;ve been working on. I have really big plans for it. It was actually the first time I successfully made a level editor too. This game is more of a mix between Soundodger and Just Shapes &amp; Beats.</p>\n<p>(Editor Preview)\n<img src=\"https://i.imgur.com/ayorjk6.png\" style=\"width: 100%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\"></p>\n<p>(Main Menu)\n<img src=\"https://i.imgur.com/Koivdzp.png\" style=\"width: 100%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\"></p>\n<p>(It&#39;s obviously more than that but you get the idea.)</p>\n<p>All screenshots are subject to change, of course.</p>\n<p>I was thinking of making a discord server where people can create and share their own levels without the risk of me being sued for copyright infringement.</p>\n<p>By the way this blog is over 1 year old now, happy birthday.</p>\n","date":"10/5/2021"},{"title":"Boxsubmus Founded + Unintended Problems","slug":"boxsubmus-founded-uninteded-problems","html":"<p>On June 12th, 2021 me and a friend created Boxsubmus. A game studio specifically for the game we have been wanting to develop for a long time. Unfortunately we had to delay those plans to finding out a very similar game has already existed for quite some time now.</p>\n<iframe src=\"https://store.steampowered.com/widget/1228610/\" frameborder=\"0\" width=\"646\" height=\"190\"></iframe>\n\n<p>I wont be going too much over detail, just know that we have to change quite a lot about out original plan. We don&#39;t plan on changing the story or core formula, but it is a bit demotivating to know we&#39;re gonna have to start from scratch again.</p>\n<p>We don&#39;t have any plans of stopping, but our time is scarce due to school starting back up in a few days. In a way I&#39;m kinda grateful we didn&#39;t put all of our effort into it.</p>\n<p>You can follow us for more updates, if interested of course.</p>\n<p><a href=\"https://twitter.com/boxsubmus?ref_src=twsrc%5Etfw\" class=\"twitter-follow-button\" data-show-count=\"false\">Follow @boxsubmus</a><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n","date":"8/1/2021"},{"title":"Custom Stroke in After Effects","slug":"custom-stroke-in-ae","html":"<p>If you didn&#39;t know, After Effects has these things called &quot;Layer Styles&quot;. These are similar, but are NOT the same as effects. As layer styles are applied after everything else. <img src=\"assets/Images/tutorials/custom stroke/1.png\" style=\"width: 90%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\"> I will go more in-depth about layer styles in a future tutorial, but this should give you the basics of all you really need to know right now.  </p>\n<p>Clicking on stroke you can see that it will apply a very simple &quot;outline&quot; effect. If you&#39;ve ever used a program like Photoshop this might seem familiar.  </p>\n<p>However you seem to notice something when motion blur is applied. \n<img src=\"assets/Images/tutorials/custom stroke/2.png\" style=\"width: 90%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\">\nThe motion blur does not effect the stroke style we added. :(<br>Luckily for us effects are here to not make us bang our head against the fucking table.  </p>\n<p>Copy my settings here. <img src=\"assets/Images/tutorials/custom stroke/3.png\" style=\"width: 50%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\"> All this basically does is &quot;mask&quot; the transparent part of our clip with blue, Keylight will key out the blue, and the &quot;Screen Matte&quot; will expand the key-ed out background and replace it with the &quot;Replace Colour&quot;. You can mess with the settings if you want. I would also recommend creating a user-made-preset since you might be using this a lot.  </p>\n<p>Seeing as the effect is now applied BEFORE the motion blur, it will now be effected by it. <img src=\"assets/Images/tutorials/custom stroke/4.png\" style=\"width: 100%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\"></p>\n","date":"4/8/2021"},{"title":"Changing The Base Colour in After Effects","slug":"changing-the-base-colour-in-after-effects","html":"<p>The default colour of After Effects might not suit you, for example I really hate blue and want to change it to orange. Or maybe you do like blue but want to darken or lighten it, here&#39;s how to do it.</p>\n<p>Open up After Effects and press (Ctrl + F12), this will open up the console. Press the dropdown on the panel and click Debug Database View. <img src=\"assets/Images/tutorials/dropdownConsoleDebugDatabase.PNG\" style=\"width: 60%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\"> Set Enable_Theme_Colorizing to &quot;true&quot;.</p>\n<img src=\"assets/Images/tutorials/consoleDebugEnableColor.PNG\" style=\"width: 60%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\">\n\n<p>Go into Preferences &gt; Appearance, and now you can change the colour to whatever you want. <img src=\"assets/Images/tutorials/preferenceappearencecolor.PNG\" style=\"width: 70%; display: block; margin-left: auto; margin-right: auto;\" alt=\"\"></p>\n","date":"9/23/2020"},{"title":"New Website Design, Blog and Other Stuff","slug":"new-website-design","html":"<p>Blog is set up, and funny thing is it runs off Github Pages. There really isn&#39;t much to say as of right now. But I&#39;ll update this frequently with new information and tutorials. !</p>\n<img src=\"https://i.imgur.com/ZhGquZz.jpg\" style=\"width: 100px; float:right; margin:20px; margin-right:-20px;\" alt=\"\">\n\n<p>For now have this banana. But expect a lot more in the future, I will totally make this wait worthwhile. Also you can click one of those tabs on the right hand side for more links to other stuff. Mainly just random sites and things I could think of. I was hoping it would add to the site, and the only thing it really added was loading time.</p>\n<p>Anyway I spent way too long on this, expect more from me soon. Thank you!</p>\n","date":"9/22/2020"}]